Repository: Centaur/lua-nginx-module
Catalog: omegat/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: For instance, if the subrequest response headers contain the following lines:
zh_cn: 例如， 如果子请求响应头包含 :

source: For large streaming output responses, it is important to disable the [[#lua_http10_buffering|lua_http10_buffering]] directive to minimise memory usage.
zh_cn: 对于大的流式输出响应，要记住禁止[[#lua_http10_bufferinglua_http10_buffering]]以减少内存占用.

source: For multi-value headers, all of the values of header will be collected in order and returned as a Lua table.
zh_cn: 对于多值头，所有的值将按顺序放在一个Lua table中返回.

source: For multi-value response headers, the value is a Lua (array) table that holds all the values in the order that they appear.
zh_cn: 对于有多值的响应头, 其值是装有按出现顺序排序的所有值的 Lua (数组) table

source: For multiple instances of request headers such as:
zh_cn: 对于有多个值的请求头如:

source: For reading ''request'' headers, use the [[#ngx.req.get_headers|ngx.req.get_headers]] function instead.
zh_cn: 要读取 ''请求'' 头, 用 [[#ngx.req.get_headers|ngx.req.get_headers]] 函数.

source: For the first two cases, the "light thread" will usually be resumed later by the ngx_lua scheduler unless a "stop-the-world" event happens.
zh_cn: 对于前两种情况, "轻量线程" 通常会在将来被 ngx_lua 调度器唤醒，除非发生了 "停止所有" 事件.

source: For the last successful invocation of the iterator function, the <code>err</code> return value will be <code>nil</code> too.
zh_cn: 对iterator函数的最后一次成功的调用, <code>err</code> 返回值为 <code>nil</code> too.

source: Forcibly updates the Nginx current time cache.
zh_cn: 强制刷新Nginx当前时间缓存.

source: Hence, changes to Nginx variables made by a subrequest will affect the current request.
zh_cn: 这样，子请求中对Nginx变量的修改将会影响到当前请求.

source: Here is a basic example:
zh_cn: 这是一个基本的例子:

source: Here is a complete small example:
zh_cn: 下面是一个完整的例子:

source: Here is a simple example:
zh_cn: 以下是一个简单的例子:

source: Here is a small example to demonstrate its basic usage:
zh_cn: 以下是对基本用法的示例:

source: Here is an example
zh_cn: 示例

source: Here is an example assuming the current server name is <code>localhost</code> and that it is listening on Port 1984:
zh_cn: 以下的例子假设当前的服务器名为 <code>localhost</code> 监听 1984 端口:

source: Here is an example for connecting to a TCP server:
zh_cn: 以下 连接到 TCP 服务器的例子:

source: Here is an example for connecting to a UDP (memcached) server:
zh_cn: 以下是连接到 UDP (memcached) 服务器的例子:

source: Here is an example for pre-loading Lua modules:
zh_cn: 以下是预加载 Lua 的例子:

source: Here is an example for this:
zh_cn: 例如：

source: Here is an example for using this method to read a data stream with the boundary sequence <code>--abcedhb</code>:
zh_cn: 以下是使用本方法来用边界序列 <code>--abcedhb</code> 读取数据:

source: Here is an example of gathering average data for [[HttpUpstreamModule#$upstream_response_time|$upstream_response_time]]:
zh_cn: 以下是收集 [[HttpUpstreamModule#$upstream_response_time|$upstream_response_time]] 平均值的例子:

source: Here is an example of overriding a response header (or adding one if absent) in our Lua header filter:
zh_cn: 下面是在Lua 头过滤器中重写（如果没有就添加）一个响应头的例子

source: Here is an example of setting the <code>Content-Length</code> header:
zh_cn: 以下是设置 <code>Content-Length</code> 头的例子:

source: Here is an example:
zh_cn: 以下是示例:

source: Here is some examples:
zh_cn: 示例:

source: Here is such an example,
zh_cn: 见下例,

source: Here is the reason: by design, the global environment has exactly the same lifetime as the Nginx request handler associated with it.
zh_cn: 原因是: 在设计上，全局环境拥有与其关联的Nginx请求处理器完全一样的生命周期.

source: Here it essentially implements the "wait all" model.
zh_cn: 这里主要实现了 "wait all" 模式.

source: Here the <code>args</code> table will always look like
zh_cn: 这里 <code>args</code> table 的内容为

source: Here the Lua code <code>ngx.exit(503)</code> will never run.
zh_cn: 此处 <code>ngx.exit(503)</code> 不会被执行.

source: Here, <code>&#91;[\\d+]]</code> is stripped down to <code>&#91;[\d+]]</code> by the Nginx config file parser and this is processed correctly.
zh_cn: 这里, <code>&#91;[\\d+]]</code> 被Nginx配置文件解析器处理成 <code>&#91;[\d+]]</code> 可以正常执行.

source: Here, <code>\\\\d+</code> is stripped down to <code>\\d+</code> by the Nginx config file parser and this is further stripped down to <code>\d+</code> by the Lua language parser before running.
zh_cn: 这里, <code>\\\\d+</code> 被Nginx配置文件解析器处理成 <code>\\d+</code> ，然后在运行之前被Lua语言解析器处理成 <code>\d+</code> .

source: Here, modification of the <code>ngx.ctx.blah</code> entry in the subrequest does not affect the one in the parent request.
zh_cn: 这里，对子请求中的 <code>ngx.ctx.blah</code> 进行修改不会影响其父请求中的值.

source: However, a workaround is possible using the [[#ngx.var.VARIABLE|ngx.var.VARIABLE]] interface.
zh_cn: 但是可以使用 [[#ngx.var.VARIABLE|ngx.var.VARIABLE]] 来绕过这个限制。

source: However, later attempts to manipulate the cosocket object will fail and return the actual error status message generated by the failed connect operation.
zh_cn: 但是，后续对cosocket对象的操作将失败，返回由连接操作失败生成的错误状态信息.

source: However, the optional <code>max_args</code> function argument can be used to override this limit:
zh_cn: 但是, 可以用可选的<code>max_args</code> 函数参数修改这个上限:

source: However, the optional <code>max_headers</code> function argument can be used to override this limit:
zh_cn: 但是, 可以用可选的<code>max_headers</code> 函数参数修改这个上限:

source: However, they are different from arguments taking empty string values.
zh_cn: 要注意，这与value为空字符串的参数是不一样的.

source: Identical to the standard Lua [http://www.lua.org/manual/5.1/manual.html#pdf-coroutine.running coroutine.running] API.
zh_cn: 与标准 Lua [http://www.lua.org/manual/5.1/manual.html#pdf-coroutine.running coroutine.running] API相同.

source: Identical to the standard Lua [http://www.lua.org/manual/5.1/manual.html#pdf-coroutine.status coroutine.status] API.
zh_cn: 与标准 Lua [http://www.lua.org/manual/5.1/manual.html#pdf-coroutine.status coroutine.status] API相同.

source: Idle connections in the pool will be monitored for any exceptional events like connection abortion or unexpected incoming data on the line, in which cases the connection in question will be closed and removed from the pool.
zh_cn: 池中的空闲连接上的任何异常事件都将被监视，如连接中断或意外的输入数据，这时出问题的连接将被关闭并从池中删除。

source: If a non-number-like string argument is specified, then it is interpreted as a "pattern".
zh_cn: 如果指定的是一个长得不象数值的字符串, 它将被理解成一种 "模式".

source: If a number-like argument is specified (including strings that look like numbers), then it is interpreted as a size.
zh_cn: 如果输入参数是数值 (或是长得象数值的字符串), 它将被理解为大小.

source: If any request body data has been pre-read into the Nginx core request header buffer, the resulting cosocket object will take care of this to avoid potential data loss resulting from such pre-reading.
zh_cn: 如果已经有请求体数据被预加载进了Nginx核心请求处理器缓冲区， 返回的cosocket对象将考虑到这一点，以避免这种预加载造成的潜在数据丢失。

source: If it stores the item without forcibly removing other valid items, then the return value <code>forcible</code> will be <code>false</code>.
zh_cn: 如果成功加入了存储项而没有删除其它的有效项, <code>forcible</code> 返回值为 <code>false</code>.

source: If no argument is specified, then it is assumed to be the pattern <code>'*l'</code>, that is, the line reading pattern.
zh_cn: 如果没有给参数，本方法默认以 <code>'*l'</code> 即按行读取模式执行.

source: If no argument is specified, then the maximal buffer size, <code>8192</code> is assumed.
zh_cn: 如果没有参数，缓冲区大小默认为 <code>8192</code> .

source: If omitted, the default setting in the [[#lua_socket_keepalive_timeout|lua_socket_keepalive_timeout]] config directive will be used.
zh_cn: 如果没有, 将使用[[#lua_socket_keepalive_timeout|lua_socket_keepalive_timeout]] 配置命令中的默认设置.

source: If omitted, then the connection pool name will be generated from the string template <code>"<host>:<port>"</code> or <code>"<unix-socket-path>"</code>.
zh_cn: 如果没有提供, 连接池的名称会以 <code>"<host>:<port>"</code> 或 <code>"<unix-socket-path>"</code>的格式自动生成.

source: If response headers have not been sent, this function will send headers out first and then output body data.
zh_cn: 如果尚未发送响应头，此函数将先发送头，再发送体数据。

source: If server-wide data sharing is required, then use one or more of the following approaches: # Use the [[#ngx.shared.DICT|ngx.shared.DICT]] API provided by this module.
zh_cn: 如果真需要实现在整个server级别的数据共享, 使用以下方法之一: # 使用本模块提供的 [[#ngx.shared.DICT|ngx.shared.DICT]] API.

source: If the <code>0</code> value is given, then the timeout interval is unlimited.
zh_cn: 如果其值是 <code>0</code> , 则没有超时时限.

source: If the <code>Content-Length</code> response header is set in the running Lua code, however, this buffering will be disabled even if the [[#lua_http10_buffering|lua_http10_buffering]] directive is turned <code>on</code>.
zh_cn: 但是如果在运行的Lua代码中设置了 <code>Content-Length</code> 响应头, 即使[[#lua_http10_buffering|lua_http10_buffering]]命令被置为 <code>on</code> 也不会做这个缓存.

source: If the <code>break</code> modifier is used instead, there will be no internal redirection and the <code>rewrite_by_lua</code> code will be executed.
zh_cn: 相反，如果使用了 <code>break</code> , 就不会有内部重定向， <code>rewrite_by_lua</code> 将被执行.

source: If the <code>buffer_size</code> argument is specified, then its value will be used for the size of the memory buffer for body writing with [[#ngx.req.append_body|ngx.req.append_body]].
zh_cn: 如果指定了 <code>buffer_size</code> 参数, 则将会用这个值作为供 [[#ngx.req.append_bodyngx.req.append_body]] 写入的内存缓冲区的大小.

source: If the <code>exptime</code> takes the value <code>0</code> (which is the default), then the item will never be expired.
zh_cn: 如果 <code>exptime</code> 值为 <code>0</code> (默认值), 此项将永不过期.

source: If the <code>key</code> argument already exists in the dictionary (and not expired for sure), the <code>success</code> return value will be <code>false</code> and the <code>err</code> return value will be <code>"exists"</code>.
zh_cn: 如果字典中已经存在 <code>key</code> 键（而且尚未过期）, <code>success</code> 将返回 <code>false</code> ， <code>err</code> 将返回 <code>"exists"</code>.

source: If the <code>key</code> argument does ''not'' exist in the dictionary (or expired already), the <code>success</code> return value will be <code>false</code> and the <code>err</code> return value will be <code>"not found"</code>.
zh_cn: 如果字典中 ''没有'' <code>key</code> 键 (或已过期), <code>success</code> 将返回 <code>false</code> <code>err</code> 将返回 <code>"not found"</code>.

source: If the <code>size</code> argument is specified, then this method will use this size as the receive buffer size.
zh_cn: 如果指定了 <code>size</code> 参数, 本方法将用此数值作为接收缓冲区的大小.

source: If the Lua code explicitly sets a <code>Content-Length</code> response header before sending the headers (either explicitly via [[#ngx.send_headers|ngx.send_headers]] or implicitly via the first [[#ngx.say|ngx.say]] or [[#ngx.print|ngx.print]] call), then the HTTP 1.0 response buffering will be disabled even when this directive is turned on.
zh_cn: 如果Lua代码在发送头（显式地通过[[#ngx.send_headersngx.send_headers]]或者隐式地通过第一个[[#ngx.sayngx.say]] 或 [[#ngx.printngx.print]]调用）之前显式地设置了 <code>Content-Length</code> 响应头，, 那么即使本命令被打开， 也不会进行HTTP 1.0 响应缓冲。

source: If the [[HttpRewriteModule]]'s [[HttpRewriteModule#rewrite|rewrite]] directive is used to change the URI and initiate location re-lookups (internal redirections), then any [[#rewrite_by_lua|rewrite_by_lua]] or [[#rewrite_by_lua_file|rewrite_by_lua_file]] code sequences within the current location will not be executed.
zh_cn: 如果使用了 [[HttpRewriteModule]] 的 [[HttpRewriteModule#rewrite|rewrite]] 命令来修改 URI 和初始 location re-lookups (内部重定向), 则当前location中的任何 [[#rewrite_by_lua|rewrite_by_lua]] 或 [[#rewrite_by_lua_file|rewrite_by_lua_file]] 代码都不会被执行。

source: If the argument is omitted, then the value specified by the standard [[HttpCoreModule#client_body_buffer_size|client_body_buffer_size]] directive will be used instead.
zh_cn: 如果没有这个参数, 将使用标准 [[HttpCoreModule#client_body_buffer_size|client_body_buffer_size]] 命令指定的值.

source: If the argument value is <code>false</code>, then the effect is equivalent to the <code>nil</code> value.
zh_cn: 如果参数值是<code>false</code>, 结果等价于 <code>nil</code> 值.

source: If the connection comes from the connection pool, then the return value is always non-zero.
zh_cn: 如果连接是从内置连接池中取出的，则返回值总是非0的.

source: If the current connection does not come from the built-in connection pool, then this method always returns <code>0</code>, that is, the connection has never been reused (yet).
zh_cn: 如果当前连接不是从内置连接池来的, 本方法总是返回 <code>0</code>, 表示此连接（尚）未被重用过.

source: If the current location includes [[#rewrite_by_lua|rewrite_by_lua]] or [[#rewrite_by_lua_file|rewrite_by_lua_file]] directives, then the request body will be read just before the [[#rewrite_by_lua|rewrite_by_lua]] or [[#rewrite_by_lua_file|rewrite_by_lua_file]] code is run (and also at the <code>rewrite</code> phase).
zh_cn: 如果当前的 location 包含[[#rewrite_by_lua|rewrite_by_lua]] 或 [[#rewrite_by_lua_file|rewrite_by_lua_file]] 命令, 那么请求体将在 [[#rewrite_by_lua|rewrite_by_lua]] 或 [[#rewrite_by_lua_file|rewrite_by_lua_file]] 代码运行之前被读取 (也是在 <code>rewrite</code> 阶段).

source: If the current request is an Nginx subrequest, then the subrequest's method name will be returned.
zh_cn: 如果当前请求是Nginx子请求, 将返回子请求的请求方法名称.

source: If the current request is an Nginx subrequest, then the subrequest's method will be overridden.
zh_cn: 如果当前请求是Nginx子请求, 则子请求的请求方法将被设置为新值.

source: If the current request's request body has not been read, then it will be properly discarded.
zh_cn: 如果当前请求的请求体尚未被读取，则其将被正确地丢弃.

source: If the key does not exist or has been expired, then <code>nil</code> will be returned.
zh_cn: 如果键不存在或已过期，返回 <code>nil</code> .

source: If the message size exceeds this limit, Nginx will truncate the message text accordingly.
zh_cn: 如果消息长度超限，Nginx 会做相应的截断。

source: If the nameserver returns multiple IP addresses for the host name, this method will pick up one randomly.
zh_cn: 如果从域名解析出来多个IP地址，本方法将从中随机选取一个.

source: If the optional <code>auto_clean</code> argument is given a <code>true</code> value, then this file will be removed at request completion or the next time this function or [[#ngx.req.set_body_data|ngx.req.set_body_data]] are called in the same request.
zh_cn: 如果可选参数 <code>auto_clean</code> 被设置为 <code>true</code> , 则文件将在请求结束时，或同一次请求中再次调用 [[#ngx.req.set_body_data|ngx.req.set_body_data]] 时被删除.

source: If the original value is not a valid Lua number in the dictionary, it will return <code>nil</code> and <code>"not a number"</code>.
zh_cn: 如果原来的值不是有效的Lua 数值, 返回 <code>nil</code> 和 <code>"not a number"</code>.

source: If the request body has already been explicitly discarded, either by the [[#ngx.req.discard_body|ngx.req.discard_body]] function or other modules, this function does not run and returns immediately.
zh_cn: 如果用[[#ngx.req.discard_bodyngx.req.discard_body]]函数或其它模块显式地丢弃了请求体，则此函数不会执行，立即返回.

source: If the request body has already been read, this function does nothing and returns immediately.
zh_cn: 如果请求体已经被读取过了，则本函数不做任何事，直接返回.

source: If the request body has been read into disk files, try calling the [[#ngx.req.get_body_file|ngx.req.get_body_file]] function instead.
zh_cn: 如果请求体已经被读进磁盘临时文件, 试试调用[[#ngx.req.get_body_file|ngx.req.get_body_file]] 函数.

source: If the request body has been read into memory, try calling the [[#ngx.req.get_body_data|ngx.req.get_body_data]] function instead.
zh_cn: 如果请求体已经被读入内存, 试试调用 [[#ngx.req.get_body_data|ngx.req.get_body_data]] .

source: If the request body has not been read yet, call [[#ngx.req.read_body|ngx.req.read_body]] first (or turned on [[#lua_need_request_body|lua_need_request_body]] to force this module to read the request body.
zh_cn: 如果请求体尚未被读取, 先调用[[#ngx.req.read_body|ngx.req.read_body]] (或打开[[#lua_need_request_body|lua_need_request_body]] 来强制本模块读取请求体.

source: If the request body is already read previously by turning on [[#lua_need_request_body|lua_need_request_body]] or by using other modules, then this function does not run and returns immediately.
zh_cn: 如果打开了[[#lua_need_request_bodylua_need_request_body]]或其它模块导致请求体已被读取，则此函数不会执行，立即返回.

source: If the response header is not present at all, <code>nil</code> will be returned.
zh_cn: 如果没有响应头，则返回 <code>nil</code>.

source: If the standard Lua 5.1 interpreter is required however, run the following command to install it from the Ubuntu repository:
zh_cn: 如果一定要使用标准Lua 5.1 解释器, 运行以下命令从Ubuntu仓库安装:

source: If the user flags is <code>0</code> (the default), then no flags value will be returned.
zh_cn: 如果用户标记是 <code>0</code> (默认值), 将不会返回标记值.

source: If the value table is empty and the effect is equivalent to the <code>nil</code> value.
zh_cn: 如果值是空的table，结果等价于 <code>nil</code> 值.

source: If this method succeeds in storing the current item by forcibly removing other not-yet-expired items in the dictionary via LRU, the <code>forcible</code> return value will be <code>true</code>.
zh_cn: 如果此方法通过采取LRU的方式从字典中删除了一些尚未过期的项, <code>forcible</code> 返回值为 <code>true</code>.

source: If this option is set to <code>true</code>, then the current request and associated subrequests will share the same Nginx variable scope.
zh_cn: 如果这个选项被置为 <code>true</code>, 则当前的请求与相关的子请求会共同同样的Nginx 变量域.

source: If up to tens of existing items have been removed and the storage left is still insufficient (either due to the total capacity limit specified by [[#lua_shared_dict|lua_shared_dict]] or memory segmentation), then the <code>err</code> return value will be <code>no memory</code> and <code>success</code> will be <code>false</code>.
zh_cn: 如果已经删除了几十项，剩下的存储空间仍然不够 (受到 [[#lua_shared_dict|lua_shared_dict]] 或内存段的限制), <code>err</code> 的返回值将为<code>no memory</code> ， <code>success</code> 为 <code>false</code>.

source: If you are already doing proper error handling and logging in your Lua code, then it is recommended to turn this directive off to prevent data flushing in your nginx error log files (which is usually rather expensive).
zh_cn: 如果你的Lua代码中已经进行了正确的错误处理和记录日志，那么建议将此命令关闭，以避免在nginx错误日志文件中不必要的数据（这通常有很大的开销）。

source: In addition to the two settings above, it is possible to specify values for variables in the subrequest using the <code>vars</code> option.
zh_cn: 除了上面两种设置外，也可以在子请求中通过 <code>vars</code> 选项设置变量.

source: In addition, note that this directive can only write out a value to a single Nginx variable at a time.
zh_cn: 另外，注意这条命令每次只能写入一个Nginx变量。

source: In addition, race conditions when reloading Lua modules are common for concurrent requests when the code cache is disabled.
zh_cn: 另外，如果禁止了代码缓存，在并发请求中重新加载模块经常会导致race condition。

source: In case of domain names, this method will use Nginx core's dynamic resolver to parse the domain name without blocking and it is required to configure the [[HttpCoreModule#resolver|resolver]] directive in the <code>nginx.conf</code> file like this:
zh_cn: 如果是域名, 本方法将使用Nginx 核心的 动态域名解析器非阻塞地解析域名，要求在 <code>nginx.conf</code> 文件里使用[[HttpCoreModule#resolver|resolver]] 命令，如:

source: In case of error, <code>nil</code> will be returned as well as a string describing the error.
zh_cn: 如果出错，将返回 <code>nil</code> 和 描述错误的字符串.

source: In case of error, it returns <code>nil</code> and a string describing the error.
zh_cn: 出错时, 返回<code>nil</code> 和描述错误的字符串.

source: In case of error, the iterator function will return <code>nil</code> along with a string describing the error and the partial data bytes that have been read so far.
zh_cn: 如果出错，iterator函数返回 <code>nil</code> 和一个描述错误的字符串，以及目前读取的部分数据.

source: In case of error, the method returns <code>nil</code> followed by a string describing the error.
zh_cn: 如果出错, 返回 <code>nil</code> 和描述错误的字符串.

source: In case of errors, like seeing a bad regular expression or exceeding the PCRE stack limit, <code>nil</code> and a string describing the error will be returned.
zh_cn: 如果出错，如正则表达式错误或超过了PCRE的栈空间限制, 返回<code>nil</code> 和描述错误的字符串.

source: In case of errors, like seeing an ill-formed regular expression, <code>nil</code> and a string describing the error will be returned.
zh_cn: 如果出错，如正则表达式格式不正确, 返回<code>nil</code> 和描述错误信息的字符串.

source: In case of errors, such as connection errors while reading the data, this method will throw out a Lua exception ''or'' terminate the current request with a 500 status code immediately.
zh_cn: 在出错的情况下，如在读取数据时的连接错误, 此函数会抛出Lua异常 ''或'' 直接终止当前请求并立即返回 500 状态码.

source: In case of failures, like syntax errors in the regular expressions or the <code><replace></code> string argument, it will return <code>nil</code> and a string describing the error.
zh_cn: 如果出错, 如正则表达式语法错或 <code><replace></code> 格式错, 返回 <code>nil</code> 和描述错误的字符串.

source: In case of success, it returns <code>1</code>.
zh_cn: 成功则返回<code>1</code>.

source: In case of success, it returns the data received; in case of error, it returns <code>nil</code> with a string describing the error and the partial data received so far.
zh_cn: 如果成功则返回接收到的数据; 如果出错则返回 <code>nil</code> 和描述错误的字符串以及接收到的部分数据.

source: In case of success, it returns the data received; in case of error, it returns <code>nil</code> with a string describing the error.
zh_cn: 如果成功则返回接收到的数据; 如果出错则返回 <code>nil</code> 和描述错误的字符串.

source: In case of success, it returns the total number of bytes that have been sent.
zh_cn: 如果成功，则返回发送的总的字节数。

source: In case of success, the method returns <code>1</code>.
zh_cn: 如果成功, 返回 <code>1</code>.

source: In case of success, this method returns <code>1</code>; otherwise, it returns <code>nil</code> and a string describing the error.
zh_cn: 成功返回 <code>1</code>; 否则返回 <code>nil</code> 和描述错误的字符串.

source: In case of table arguments, this method will copy all the string elements piece by piece to the underlying Nginx socket send buffers, which is usually optimal than doing string concatenation operations on the Lua land.
zh_cn: 如果是table参数， 本方法会将所有的字符串元素一块一块地拷贝到下层Nginx socket发送缓冲区，通常这比在Lua里进行字符串拼接要快。

source: In cases where current request may have a request body and the request body data is not required, The [[#ngx.req.discard_body|ngx.req.discard_body]] function must be used to explicitly discard the request body to avoid breaking things under HTTP 1.1 keepalive or HTTP 1.1 pipelining.
zh_cn: 有时候当前请求可能有但不一定有请求体，需要使用 [[#ngx.req.discard_body|ngx.req.discard_body]] 函数来显式地丢弃请求体，以防止在HTTP 1.1 keepalive或HTTP 1.1 pipelining时出错。

source: In fact, all CR characters are ignored by the pattern.
zh_cn: 事实上，模式会忽略所有的回车符.

source: In older versions of Nginx, the limit was <code>50</code> concurrent subrequests and in more recent versions, Nginx <code>1.1.x</code> onwards, this was increased to <code>200</code> concurrent subrequests.
zh_cn: 在旧版本的Nginx中, 这个上限是 <code>50</code> 而在最近的版本, Nginx <code>1.1.x</code> 以上, 这个上限增加到了 <code>200</code>。

source: In other words, no time-slicing is performed automatically.
zh_cn: 换句话说，分时并不是自动进行的.

source: In synchronous mode, the function will not return until all output data has been written into the system send buffer or until the [[HttpCoreModule#send_timeout|send_timeout]] setting has expired.
zh_cn: 在同步模式中， 函数只有当所有输出数据全部写入系统发送缓冲区后，或到达 [[HttpCoreModule#send_timeout|send_timeout]] 设置的超时时限时才返回。

source: In the case of HTTP 1.1 chunked encoded output, it will just trigger the Nginx core to send out the "last chunk".
zh_cn: 在 HTTP 1.1 chunked 编码输出中, 这将导致Nginx核心发送 "last chunk".

source: In the settings above, <code>GET /test?a%20b=1%61+2</code> will yield:
zh_cn: 在上面的设置中, <code>GET /test?a%20b=1%61+2</code> 的结果为:

source: In this case, it will immediately return <code>nil</code> and the string "no memory".
zh_cn: 在这种情况下，它将立即返回 <code>nil</code> 和错误信息 "no memory".

source: Increments the (numerical) value for <code>key</code> in the shm-based dictionary [[#ngx.shared.DICT|ngx.shared.DICT]] by the step value <code>value</code>.
zh_cn: 为基于共享内存的字典[[#ngx.shared.DICTngx.shared.DICT]]中<code>key</code>键的数值加上 <code>value</code>.

source: Instead, the reading operation on [[#ngx.req.socket|ngx.req.socket]] will just return the error message "client aborted" as the second return value (the first return value is surely <code>nil</code>).
zh_cn: 而是从对[[#ngx.req.socket|ngx.req.socket]]的读操作中返回，携带错误信息 "client aborted" 作为第二个返回值 (第一个返回值当然是 <code>nil</code>).
